mail.org
#+TITLE: Mail and Emacs
#+PROPERTY: header-args :mkdirp yes

* PROJECT Setup mu4e in emacs
:PROPERTIES:
:CREATED:  [2020-05-16 Sat 12:08]
:ID:       d8343324-2695-42e4-882d-2d147e7627b5
:header-args:elisp: :tangle ~/.doom.d/+mail.el
:END:
https://github.com/seanfarley/mu4e-patch/blob/master/README.org
https://github.com/org-mime/org-mime

A large portion of my mu4e config is taken from [[https://github.com/lepisma/rogue/tree/master/local/r-mu4e][lepisma's r-mu4e]] and Ambrevar's [[https://gitlab.com/ambrevar/dotfiles/-/blob/master/.emacs.d/lisp/init-mu4e.el][config]].

** NEXT Rework blocks into sections/TODO
:PROPERTIES:
:CREATED:  [2022-02-12 Sat 14:57]
:ID:       cb4fb1b0-be96-42fb-b004-9610c85d0351
:END:
#+begin_src elisp
;;; $DOOMDIR/+mail.el -*- lexical-binding: t; -*-

;; (org-link-set-parameters "mu4e" :follow #'org-mu4e-open :store
;; #'org-mu4e-store-link)

(use-package! org-mu4e
  :after mu4e)
;; configure email


;; (map! :localleader
;;       :map mu4e-compose-mode-map
;;       :desc "Attach file" "a" 'mml-attach-file
;;       :desc "Send message" "s" 'message-send-and-exit)
#+end_src

We use ~:defer~ here so that we can give the mail address secrets to load later on.

#+begin_src elisp
(use-package! mu4e
  :defer 20
  :init
  (setq mu4e-maildir "~/.mail"
        mu4e-get-mail-command "mbsync -Va"
        mu4e-update-interval (* 10 60)
        message-kill-buffer-on-exit t
        ;; mu4e-headers-auto-update nil ; no refresh cos lose current filter
        mu4e-change-filenames-when-moving t ; Preferred for mbsync according to man page.)

        ;; Don't bother me with context on startup
        ;; mu4e-context-policy nil

        ;; Attachments
        ;; Use Ivy for mu4e completions (maildir folders, etc)
        (setq mu4e-completing-read-function #'ivy-completing-read)
        ;; mu4e-attachment-dir "~/Downloads"
        ;; mu4e-save-multiple-attachments-without-asking t
        ;; mu4e-compose-signature-auto-include nil)

  ;; Display
  (setq message-yank-prefix "")
  (setq message-yank-cited-prefix "")
  (setq message-yank-empty-prefix "")
  (setq message-indentation-spaces 4)
  (setq message-cite-reply-position 'above)
  (setq  message-citation-line-format "On %Y-%m-%d at %R %Z, %f wrote...")

  :config

  ;; SMTP stuff
  (setq send-mail-function 'smtpmail-send-it
        ;; message-send-mail-function 'message-send-mail-with-sendmail
        ;; substitute sendmail with msmtp
        ;; sendmail-program "msmtp"
        ;; allow setting account through email header
        message-sendmail-extra-arguments '("--read-envelope-from")
        message-sendmail-f-is-evil t)

  ;; enable format=flowed
  ;; - mu4e sets up visual-line-mode and also fill (M-q) to do the right thing
  ;; - each paragraph is a single long line; at sending, emacs will add the
  ;;   special line continuation characters.
  ;; - also see visual-line-fringe-indicators setting below
  (setq mu4e-compose-format-flowed t)
  ;; because it looks like email clients are basically ignoring format=flowed,
  ;; let's complicate their lives too. send format=flowed with looong lines. :)
  ;; https://www.ietf.org/rfc/rfc2822.txt
  (setq fill-flowed-encode-column 998)

  ;; Composing mail
  (setq mu4e-compose-dont-reply-to-self t)

  (setq mu4e-bookmarks (list (make-mu4e-bookmark
                              :name "Uni Inbox"
                              :query (concat "maildir:/unsw/INBOX OR "
                                             "maildir:/zmail/INBOX")
                              :key ?i)
                             (make-mu4e-bookmark
                              :name "Work Inbox"
                              :query "maildir:/translating/INBOX"
                              :key ?w)
                             ;; (make-mu4e-bookmark
                             ;;  :name "Work Unread"
                             ;;  :query "maildir:/Work/INBOX AND flag:unread"
                             ;;  :key ?q)
                             ;; (make-mu4e-bookmark
                             ;;  :name "All Sent"
                             ;;  :query (concat "\"maildir:/Gmail/[Gmail].Sent Mail\" OR "
                             ;;                 "maildir:/Fastmail/Sent OR "
                             ;;                 "\"maildir:/Work/[Gmail].Sent Mail\"")
                             ;;  :key ?s)
                             (make-mu4e-bookmark
                              :name "Personal Unread"
                              :query (concat "maildir:/gmail/INBOX AND flag:unread OR "
                                             "maildir:/personal/INBOX AND flag:unread")
                              :key ?p))
        ;; (make-mu4e-bookmark
        ;;  :name "Personal Archived"
        ;;  :query (concat "maildir:/Gmail/[Gmail].Archive OR "
        ;;                 "maildir:/Fastmail/Archive")
        ;; :key ?a)
        ))

#+end_src

Attempting to generate email info from pass file instead of revealing email addresses in my configs on github.

#+begin_src elisp
(use-package! auth-source-pass)
(auth-source-pass-enable)

(after! mu4e
  :config
  (setq mail/personal (auth-source-pass-get "user" "email/personal/hotmail")
        mail/translating (auth-source-pass-get "user" "email/work/translating")
        mail/ad (auth-source-pass-get "user" "email/uni/ad")
        mail/student (auth-source-pass-get "user" "email/uni/student")
        domain/personal (auth-source-pass-get "domain" "email/personal/hotmail")
        domain/translating (auth-source-pass-get "domain" "email/work/translating")
        domain/student (auth-source-pass-get "domain" "email/uni/student")))
#+end_src

I guess I could also split on the domain and return the domain that way:
#+begin_src elisp :tangle no
(car (cdr (s-split "@" mail/personal)))
#+end_src

The meat of the config, this block sets up sending from the given addresses

I'm not sure that the =(symbol-value 'x)= syntax is the best way to go about getting the value for the rx, I'll have to investigate.

#+begin_src elisp
(after! mu4e
  :config

  (setq mu4e-contexts
    (list
      (make-mu4e-context
    :name "UNSW"
    :enter-func (lambda () (mu4e-message "Switch to the uni context"))
    :match-func (lambda (msg)
        (when msg
          (mu4e-message-contact-field-matches msg :to (symbol-value 'mail/student))))
      :vars `((user-mail-address . ,mail/student)
              (mu4e-sent-folder . "/unsw/Sent")
              (mu4e-drafts-folder . "/unsw/Drafts")
              (mu4e-trash-folder . "/unsw/Trash")
              (mu4e-refile-folder . "/unsw/Archive")
              (mu4e-sent-messages-behavior . sent)
              (smtpmail-smtp-user . ,mail/ad)
              (smtpmail-local-domain . ,domain/student)
              (smtpmail-default-smtp-server . "smtp.office365.com")
              (smtpmail-smtp-server . "smtp.office365.com")
              (smtpmail-smtp-service . 587)))
        (make-mu4e-context
      :name "personal"
      :enter-func (lambda () (mu4e-message "Switch to the personal context"))
      :match-func (lambda (msg)
        (when msg
          (mu4e-message-contact-field-matches msg :to (symbol-value 'mail/personal))))
      :vars `((user-mail-address . ,mail/personal)
              (mu4e-sent-folder . "/personal/Sent")
              (mu4e-drafts-folder . "/personal/Drafts")
              (mu4e-trash-folder . "/personal/Trash")
              (mu4e-refile-folder . "/personal/Archive")
              (mu4e-sent-messages-behavior . sent)
              ;; (message-send-mail-function . smtpmail-send-it)
              (smtpmail-stream-type . starttls)
              (smtpmail-smtp-user . ,mail/personal) ;
              ;; (smtpmail-auth-credentials . (expand-file-name "~/.authinfo.gpg"))
              (smtpmail-default-smtp-server . "smtp.office365.com")
              (smtpmail-smtp-server . "smtp.office365.com")
              (smtpmail-smtp-service . 587)))
        (make-mu4e-context
          :name "translating"
          :enter-func (lambda () (mu4e-message "Switch to the translation context"))
          :match-func (lambda (msg)
            (when msg
              (mu4e-message-contact-field-matches msg :to (symbol-value 'mail/translating))))
          :vars `((user-mail-address . ,mail/translating)
                  (mu4e-sent-folder . "/translating/Sent")
                  (mu4e-drafts-folder . "/translating/Drafts")
                  (mu4e-trash-folder . "/translating/Trash")
                  (mu4e-refile-folder . "/translating/Archive")
                  (mu4e-sent-messages-behavior . sent)
                  ;; (message-send-mail-function . smtpmail-send-it)
                  (smtpmail-stream-type . ssl)
                  (smtpmail-smtp-user . ,mail/translating)
                  (smtpmail-local-domain . ,domain/translating)
                  (smtpmail-default-smtp-server . "smtp.fastmail.com")
                  (smtpmail-smtp-server . "smtp.fastmail.com")
                  (smtpmail-smtp-service . 465)))))
  (mu4e t))
#+end_src

** NEXT Set default download locations for mu4e                    :@computer:
:PROPERTIES:
:TRIGGER:  chain-find-next(NEXT,from-current,priority-up,effort-down)
:CREATED:  [2022-02-12 Sat 14:53]
:ID:       ac237473-04e6-447e-ad24-1c9c42892540
:END:

https://www.djcbsoftware.nl/code/mu/mu4e/Attachments.html

** TODO Go over mu4e tips                                          :@computer:
:PROPERTIES:
:CREATED:  [2022-02-12 Sat 14:53]
:ID:       153be129-cee6-4046-9bc9-247501c023fc
:END:

https://www.reddit.com/r/emacs/comments/9ozezm/regale_me_with_your_mu4e_tips_tricks/

** TODO Modify mu4e with extra goodies                             :@computer:
:PROPERTIES:
:CREATED:  [2022-02-12 Sat 14:53]
:ID:       17485cc2-4ef2-4f49-944d-df29dd266224
:END:

https://www.reddit.com/r/emacs/comments/8q84dl/tip_how_to_easily_manage_your_emails_with_mu4e/
http://pragmaticemacs.com/mu4e-tutorials/
https://develop.spacemacs.org/layers/+email/mu4e/README.html

** TODO Get mu4e-conversation working                              :@computer:
:PROPERTIES:
:CREATED:  [2022-02-12 Sat 14:53]
:ID:       0044deff-bedb-48e0-b916-edfdaadec5e9
:END:

https://gitlab.com/ambrevar/mu4e-conversation

** TODO Implement clickable mailto: links for mu4e/firefox         :@computer:
:PROPERTIES:
:CREATED:  [2022-02-12 Sat 14:53]
:ID:       862a87ae-ad3a-4532-a46a-29c932f634b8
:END:

https://groups.google.com/forum/#!topic/mu-discuss/Uce5fTro9gU


* mbsync                                                                :crypt:
:PROPERTIES:
:CREATED:  [2020-07-29 Wed 17:16]
:ID:       3bc99a8f-3e37-45c5-a662-2aaed569e389
:header-args:conf: :tangle ~/.mbsyncrc
:END:

-----BEGIN PGP MESSAGE-----

jA0EBwMC0/3lgSwOA6Hr0uoBrN+gQ+XnEq24Yd0gF7Ct4ZHd4uhYmXyt3SitTz0E
s/24HCB/iZXvU4GxrCV75GXsQZy4+nQJMW3p9e+O/d3MJP/qbO4PJ6iolCivto81
QfgP7dkWncYLasUSFBx3yhKA9BMWb/uQvH7P3lP/Rr8wiTw3+/7WfURwyk8srFZG
D1UVt+rKq5Eu3+Murklv2EAqNx8EalCnaiMKF2eh3grdcCydpqa60rkPYLJ8pZve
96BjSXbzXOl2tiqpLGkLuK8H1jSfTcTGkkU97+75gTYbCJzcm66aCl625N1cfpG+
vGfou/Kjg5TFjGs3WS5KaD6YUvyCXC4tRcDxYWT+Q11s0BYgVGKsapV6NB6wuLbQ
xw1A5Rqx6ZQlhLFA4Lrt2xModaMBP+OMvK8AsbmJnXx+Ke6s29Rul58r9b2P8Amb
rYuVNdfc756OhBGK5ZtxYdnKIt7sR+cSnWJE13mkfXYD/7ynNjKsDv5aq1M/EXSF
3kfOtWZMDmYEr0hb8dOi9Wcm1Wgto3wL3SgWhqa0MDUbFmaARCKv6Lmhfop+JI1P
Oc/Jkx3QOLDlnlfjuqOb18yjUDHZk9u0MiNHTH8LLqH8+RvOm2Z9mjUsLdXtot1V
4n75L17YP62y6/DVyENn82pM3adDYNlHzF/6vqc9A6q4KVBXKfY/MJf7zfp1jRHi
3CEOsgBYuUYl8iQRHuDQNv1vicKufLWDio1d6VgiJmMKlOY2pFZU/dOOTZ66JCO6
MJOf2n5LccuFLI+19P++T/jw6is9fvNYDHr92Y9u+WNjy45L36sUSQAcLRZOfORw
962h3Y4c/kVypwBESifLOhfH3cJ5qKvb3gmiXbNDUaBkCFaukAD/W1mz86sxZuyq
3NMN+9wXWOUTwU8fdPFTPHWaRvPnylF8WhaWQyQqawIG/f1vwA2g82xFCoanKU9I
bmBdIQswl840loKK1/QmIbxqiyrvfj63tti4VVWjyB2vTIlXkKZX0x/TwT2C/OG+
iIwm/K7C5toajx4oGMAhtMah4Srs9Gta9JFke7rMaC3rHXsVLQyGWA49sAbJ3AQJ
rscOZL65YPm2MbpPuX0e2HwgHyraJUWkaSYZ94ElnbjMTDZ656R/C4vDr9Sr+fOU
SOdcjbFx9WP2exLm71rJNhhDrlLtvXmKG9KFPDExbfV2GwW45rIgYTg+D4JtYuEC
pFpi1HOltSi/FOl5mQccQurwpm8/THlZj9FMoW12c9fT/NtVsN/nXanNGeboJXua
yXbREpJ/LtfWpCs2izSABthogyOwRv5+YPJC4JE6zmlXkzDrDdr4hYVCOhL1VfX3
wDBZgd9vfVg7aMxroSVoQrgL4wJ2mCa2QT1SX8NC3vvn6cLo0xoAqnzdoZt3fzqS
L0BUrB2sGI3pBcipYJSJDyU6/aYrzRKe0zBVfeBeI1UlYAHfz5ByMNMLKvDtLo0p
1JvzO1AuZKSL025uOsy6NKxCyQktX4tBjyTUFNVwCHmdFjdJn8Zr4g3KHOLT0hnQ
pPWUJZiLlHJVs2WeJrLJ9bjesSRVx8OhdbVh9DANGkS41XZ9nXqeybZZ3xADy0M5
TZgb/dlE/L444RcUR1J5bQKg+ZOhR+JbWsynhXOQoZAq4Y3Gtklgh65fWUF1PMux
Mw2HVMG2xb2N0rrUx6JiYKgs1T0rBMkQ5P+TBWET1jhW+4f1CVU2V47Ce1eB05EM
XmH6eonqJmjJUyQmyo8uvZ30rXccny1ohFJdo7wn2BpjI26J0qbhFSV711F3mXr3
zlrSws8KRkI9IBhzrgG1HXahVLAUMpML9i3DDfM2sLig9Hz1GUNXNwKo6N++1VHS
O0wZKKMFvEX4C8woddRsPER/f7Gh61wfmmq1d0eQzHXIhtj6M2qJByFJm+Yhka6H
PIbStZMsfQkoxAzTtmchKBf/Eklkq09QV0xyoVEhKg0n/CGUb9G+8UaLFIbaVv+w
saKwdL6qUYllmD5AfcD5S4qDSDLVGzwoagVwswA5zkiSeUQwotIHITsA8cIfQhLs
SIFjRHim8bLvhSHQuuUyQhz+wH8DeUJa45aMWEs5gft2msgwM9V0zdTCrbo0yJEE
wncnJ/Zh1EgyF/MvP348KVlUy6C8cNvKNYsAVPrqHw9kZAGyDRlu7u5/EG022ixb
9MMpGFb5A7WBKS+s/5j2RCIwMSStgdbW7cbKv5eSuyNwvHXeYVcaY87ibo+x8DOX
x2KT6umo5CuvPInUhWdzGOSSrd0wH77fu7XZZOlSo7Q1KWNfYlMnrGi0adTEQER0
Pa3YKDXk7yEPQBxNv+E94+kih/OUfPmhTBEoPkAq/IJU+Mk1GFpo+VTEWntWgRvf
ovplTEkSx38SgkjM9mHRXHHpP0NCdMylPSLxzQ2UADDMaC1T0AcfGFUJzycS9PNh
LpdZERftKl+NxvrOwW7/q44ByYVT6SHfiZoXZOW4/fQJF+IyK6f5Bt3KBQZvUFLN
sXq5
=lTDk
-----END PGP MESSAGE-----
* Installing mu4e on a new machine
:PROPERTIES:
:CREATED:  [2020-08-03 Mon 17:53]
:ID:       7a1a121e-7e31-4890-b753-d77f9b4ddda1
:END:
** Copy over config + maildir
:PROPERTIES:
:CREATED:  [2020-05-16 Sat 12:08]
:ID:       8699b9b3-8eb6-4e94-8aea-3fa07e72dbac
:END:
After importing and trusting GPG2 keys, then copy everything over and run
~isync~ to sync folders

#+begin_src shell
  scp corewolf:~/.mbsyncrc ~/
  scp -r corewolf:~/.Maildir ~/
  scp -r corewolf:~/.mbsyncrc ~/
#+end_src
** Rebuild mu
:PROPERTIES:
:CREATED:  [2020-05-16 Sat 12:08]
:ID:       56c06253-bce6-48ee-81e0-6a589c60c6da
:END:
mu index --rebuild --maildir=~/.Maildir

** Get new app password from hotmail
:PROPERTIES:
:CREATED:  [2020-05-16 Sat 12:08]
:ID:       c4b8f685-9f94-415d-8e4b-9fe35a29479e
:END:
1. https://account.microsoft.com/security
2. Select More security options
3. App passwords -> Create new app password
4. Copy to .authinfo.gpg

** Then run mbsync
:PROPERTIES:
:CREATED:  [2020-05-16 Sat 12:08]
:ID:       0e0363e7-43e2-4fc3-8fef-d57375d06d0c
:END:
mbsync

** TODO Programmimatically send emails with mu4e
:PROPERTIES:
:CREATED:  [2020-05-28 Thu 10:06]
:ID:       bf470fb3-eeb0-413a-aa56-93cfa68e0981
:END:
:RESOURCES:
- [[https://www.reddit.com/r/emacs/comments/g4svr2/programmatically_send_emails_with_mu4e/][Programmatically send emails with mu4e : emacs]]
:END:
* Dependencies
:PROPERTIES:
:CREATED:  [2021-09-22 Wed 13:19]
:ID:       d0ddff6f-eadc-4dd9-8ed8-b77c8c01d94c
:END:

#+begin_src scheme :tangle ~/.config/guix/manifests/mail.scm

  (specifications->manifest
   '("mu"
     "isync"))

#+end_src
